# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 with SC-ELAN-LSKA-TSCG-CAI (LSKA + TSCG + Class-Adaptive Interaction)
# CAI branch is training-only and bypassed at inference for zero runtime overhead
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  # n: [0.50, 0.25, 1024] # summary: 181 layers, ~2.8M parameters, ~7.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, ~10.2M parameters, ~24.3 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, ~21.5M parameters, ~74.2 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, ~27.1M parameters, ~95.8 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, ~60.5M parameters, ~210.5 GFLOPs

# YOLO11n-scelan-lska-tscg-cai backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, SC_ELAN_LSKA_TSCG_CAI, [256, 256, 256]] # 2 - LSKA + TSCG + CAI
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, SC_ELAN_LSKA_TSCG_CAI, [512, 512, 512]] # 4 - LSKA + TSCG + CAI
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, SC_ELAN_LSKA_TSCG_CAI, [512, 512, 512]] # 6 - LSKA + TSCG + CAI
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8 - Keep C3k2 for deep features
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n-scelan-lska-tscg-cai head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, SC_ELAN_LSKA_TSCG_CAI, [512, 512, 512]] # 13 - LSKA + TSCG + CAI

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, SC_ELAN_LSKA_TSCG_CAI, [256, 256, 256]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, SC_ELAN_LSKA_TSCG_CAI, [512, 512, 512]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
